# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-pose-p6 keypoints/pose estimation model. For Usage examples see https://docs.ultralytics.com/tasks/pose

# Parameters
nc: 1 # number of classes
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n-p6.yaml' will call yolov8-p6.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0x6 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 64]] # 0-P2/4
  - [-1, 3, C2f_EMBC, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 2-P3/8
  - [-1, 6, C2f_EMBC, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 4-P4/16
  - [-1, 6, C2f_EMBC, [512, True]]
  - [-1, 1, Conv, [768, 3, 2]] # 6-P5/32
  - [-1, 3, C2f_EMBC, [768, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P6/64
  - [-1, 3, C2f_EMBC, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 10

# YOLOv8.0x6 head
head:
  - [3, 1, Conv, [256]]  # 11-P3/8
  - [5, 1, Conv, [256]]  # 12-P4/16
  - [7, 1, Conv, [256]]  # 13-P5/32
  - [10, 1, Conv, [256]]  # 14-P6/64

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15-P6->P5
  - [[-1, 13], 1, Fusion, []] # 16-P5
  - [-1, 3, C2_Rep1, [256, False]] # 17-P5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18-P5->P4
  - [[-1, 12], 1, Fusion, []] # 19-P4
  - [-1, 3, C2_Rep1, [256, False]] # 20-P4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21-P4->P3
  - [[-1, 11], 1, Fusion, []] # 22-P3
  - [-1, 3, C2_Rep1, [256, False]] # 23-P3

  - [1, 1, Conv, [256, 3, 2]] # 24-P2->P3
  - [[-1, 11, -2], 1, Fusion, []] # 25-P3
  - [-1, 3, C2_Rep1, [256, False]] # 26-P3

  - [-1, 1, Conv, [256, 3, 2]] # 27 P3->P4
  - [[-1, 12, 20], 1, Fusion, []] # 28-P4
  - [-1, 3, C2_Rep1, [256, False]] # 29-P4

  - [-1, 1, Conv, [256, 3, 2]] # 30 P4->P5
  - [[-1, 13, 17], 1, Fusion, []] # 31-P5
  - [-1, 3, C2_Rep1, [256, False]] # 32-P5

  - [-1, 1, Conv, [256, 3, 2]] # 33 P5->P6
  - [[-1, 14], 1, Fusion, []] # 34-P6
  - [-1, 3, C2_Rep1, [256, False]] # 35-P6

  - [[26, 29, 32, 35], 1, Pose_LSCD, [nc, kpt_shape, 256]] # Pose(P3, P4, P5, P6)